app/controllers/articles_controller.rb

INSERT INTO `articles` (`title`, `text`, `created_at`, `updated_at`) VALUES ('ruby first', 'ksjdlfjaldjfa;这个是内容', '2017-02-15 05:19:19', '2017-02-15 05:19:19')
---
	def create
		#render plain: params["article"].inspect
		@article = Article.new(article_params)
		if @article.save

SELECT  `articles`.* FROM `articles` WHERE `articles`.`id` = 1 LIMIT 1
UPDATE `articles` SET `text` = 'ksjdlfjaldjfa;这个是内容update', `updated_at` = '2017-02-15 06:45:48' WHERE `articles`.`id` = 1
---
    def update
        @article = Article.find(params[:id])

        if @article.update(article_params)